Revit 2027 API
RuledSurface.HasSecondProfilePoint Method
 Checks if a point was used to define the second profile.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool HasSecondProfilePoint()
Public Function HasSecondProfilePoint As Boolean
public:
bool HasSecondProfilePoint()
member HasSecondProfilePoint : unit -> bool
Return Value
Boolean
 True if a point was used to define the second profile, false otherwise.
See Also
Reference
RuledSurface Class
Autodesk.Revit.DB Namespace